cf_billing/AccumulationRegisters/бестОбъемНачисленийЭлектроэнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестОбъемНачисленийЭлектроэнергии</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСредневзвешенная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаСбытовуюНадбавку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаСбытовуюНадбавкуПокупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаУслугиПоПередачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаИныеУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСредневзвешеннаяНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаСбытовуюНадбавкуНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаСбытовуюНадбавкуНДСПокупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаУслугиПоПередачиНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаИныеУслугиНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньНапряженияРасчетный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргУровниНапряжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяМощность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифНаИныеУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифЗаСбытовуюНадбавку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифЗаСбытовуюНадбавкуПокупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифЗаУслугиПоПередачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифСредневзвешенный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВДолевойСхеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВнутриИныеУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВнутриСбытоваяНадбавка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВнутриУслугиПоПередачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВнутри</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчаствуетВРаспределенииМКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыТарифаНезависимыйСбыт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовышающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеОтПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыЦенНаЭЭ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Enums/бестЦеновыеКатегории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестЦеновыеКатегории</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПерваяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВтораяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТретьяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧетвертаяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПятаяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШестаяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Население</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестОбъемНачисленийЭлектроэнергии/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Регистратор 						= ЭтотОбъект.Отбор.Регистратор.Значение;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.бестНачислениеЭлектроэнергии") Тогда
		НачисленныйСреднийОбъем 			= РегистрыНакопления.бестНачисленныйСреднийОбъемЭЭ.СоздатьНаборЗаписей();
		НачисленныйСреднийОбъем.Отбор.Регистратор.установить(Регистратор);
		
		Результат = РезультатЗапросаНачисленныйСреднийОбъемЭЭ(ЭтотОбъект.Выгрузить());
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЗаписьНачисленныйСредний 		= НачисленныйСреднийОбъем.ДобавитьПриход();
			ЗаполнитьЗначенияСвойств(ЗаписьНачисленныйСредний, Выборка);
		КонецЦикла;
		НачисленныйСреднийОбъем.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатЗапросаНачисленныйСреднийОбъемЭЭ(НачисленныйОбъемЭЭ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НачисленныйОбъемЭЭ.Период КАК Период,
	               |	НачисленныйОбъемЭЭ.Регистратор КАК Регистратор,
	               |	НачисленныйОбъемЭЭ.НомерСтроки КАК НомерСтроки,
	               |	НачисленныйОбъемЭЭ.Активность КАК Активность,
	               |	НачисленныйОбъемЭЭ.Организация КАК Организация,
	               |	НачисленныйОбъемЭЭ.Район КАК Район,
	               |	НачисленныйОбъемЭЭ.МКД КАК МКД,
	               |	НачисленныйОбъемЭЭ.СпособНачисления КАК СпособНачисления,
	               |	НачисленныйОбъемЭЭ.ПериодНачисления КАК ПериодНачисления,
	               |	НачисленныйОбъемЭЭ.ОбъектРасчета КАК ОбъектРасчета,
	               |	НачисленныйОбъемЭЭ.ТочкаУчета КАК ТочкаУчета,
	               |	НачисленныйОбъемЭЭ.Услуга КАК Услуга,
	               |	НачисленныйОбъемЭЭ.Поставщик КАК Поставщик,
	               |	НачисленныйОбъемЭЭ.Договор КАК Договор,
	               |	НачисленныйОбъемЭЭ.ПриборУчета КАК ПриборУчета,
	               |	НачисленныйОбъемЭЭ.Шкала КАК Шкала,
	               |	НачисленныйОбъемЭЭ.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	НачисленныйОбъемЭЭ.ОтклонениеОтПлана КАК ОтклонениеОтПлана,
	               |	НачисленныйОбъемЭЭ.ОбъемУслуги КАК ОбъемУслуги,
	               |	НачисленныйОбъемЭЭ.СуммаСредневзвешенная КАК СуммаСредневзвешенная,
	               |	НачисленныйОбъемЭЭ.СуммаЗаСбытовуюНадбавку КАК СуммаЗаСбытовуюНадбавку,
	               |	НачисленныйОбъемЭЭ.СуммаЗаУслугиПоПередачи КАК СуммаЗаУслугиПоПередачи,
	               |	НачисленныйОбъемЭЭ.СуммаЗаИныеУслуги КАК СуммаЗаИныеУслуги,
	               |	НачисленныйОбъемЭЭ.Сумма КАК Сумма,
	               |	НачисленныйОбъемЭЭ.СуммаСредневзвешеннаяНДС КАК СуммаСредневзвешеннаяНДС,
	               |	НачисленныйОбъемЭЭ.СуммаЗаСбытовуюНадбавкуНДС КАК СуммаЗаСбытовуюНадбавкуНДС,
	               |	НачисленныйОбъемЭЭ.СуммаЗаУслугиПоПередачиНДС КАК СуммаЗаУслугиПоПередачиНДС,
	               |	НачисленныйОбъемЭЭ.СуммаЗаИныеУслугиНДС КАК СуммаЗаИныеУслугиНДС,
	               |	НачисленныйОбъемЭЭ.СуммаНДС КАК СуммаНДС,
	               |	НачисленныйОбъемЭЭ.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
	               |	НачисленныйОбъемЭЭ.ЦеноваяКатегория КАК ЦеноваяКатегория
	               |ПОМЕСТИТЬ НачисленныйОбъемЭЭ
	               |ИЗ
	               |	&НачисленныйОбъемЭЭ КАК НачисленныйОбъемЭЭ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НачисленныйОбъемЭЭ.Организация КАК Организация,
	               |	НачисленныйОбъемЭЭ.Район КАК Район,
	               |	НачисленныйОбъемЭЭ.МКД КАК МКД,
	               |	НачисленныйОбъемЭЭ.ОбъектРасчета КАК ОбъектРасчета,
	               |	НачисленныйОбъемЭЭ.ТочкаУчета КАК ТочкаУчета,
	               |	МАКСИМУМ(НачисленныйОбъемЭЭ.ПовышающийКоэффициент) КАК ПовышающийКоэффициент
	               |ПОМЕСТИТЬ МаксимальныйПовышающийКоэффициент
	               |ИЗ
	               |	НачисленныйОбъемЭЭ КАК НачисленныйОбъемЭЭ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НачисленныйОбъемЭЭ.ТочкаУчета,
	               |	НачисленныйОбъемЭЭ.МКД,
	               |	НачисленныйОбъемЭЭ.ОбъектРасчета,
	               |	НачисленныйОбъемЭЭ.Организация,
	               |	НачисленныйОбъемЭЭ.Район
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НачисленныйОбъемЭЭ.Период КАК Период,
	               |	НачисленныйОбъемЭЭ.Регистратор КАК Регистратор,
	               |	НачисленныйОбъемЭЭ.НомерСтроки КАК НомерСтроки,
	               |	НачисленныйОбъемЭЭ.Активность КАК Активность,
	               |	НачисленныйОбъемЭЭ.Организация КАК Организация,
	               |	НачисленныйОбъемЭЭ.Район КАК Район,
	               |	НачисленныйОбъемЭЭ.МКД КАК МКД,
	               |	НачисленныйОбъемЭЭ.СпособНачисления КАК СпособНачисления,
	               |	НачисленныйОбъемЭЭ.ПериодНачисления КАК ПериодНачисления,
	               |	НачисленныйОбъемЭЭ.ОбъектРасчета КАК ОбъектРасчета,
	               |	НачисленныйОбъемЭЭ.ТочкаУчета КАК ТочкаУчета,
	               |	НачисленныйОбъемЭЭ.Услуга КАК Услуга,
	               |	НачисленныйОбъемЭЭ.Поставщик КАК Поставщик,
	               |	НачисленныйОбъемЭЭ.Договор КАК Договор,
	               |	НачисленныйОбъемЭЭ.ПриборУчета КАК ПриборУчета,
	               |	НачисленныйОбъемЭЭ.Шкала КАК Шкала,
	               |	НачисленныйОбъемЭЭ.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	НачисленныйОбъемЭЭ.ОтклонениеОтПлана КАК ОтклонениеОтПлана,
	               |	НачисленныйОбъемЭЭ.ОбъемУслуги КАК ОбъемУслуги,
	               |	НачисленныйОбъемЭЭ.СуммаСредневзвешенная КАК СуммаСредневзвешенная,
	               |	НачисленныйОбъемЭЭ.СуммаЗаСбытовуюНадбавку КАК СуммаЗаСбытовуюНадбавку,
	               |	НачисленныйОбъемЭЭ.СуммаЗаУслугиПоПередачи КАК СуммаЗаУслугиПоПередачи,
	               |	НачисленныйОбъемЭЭ.СуммаЗаИныеУслуги КАК СуммаЗаИныеУслуги,
	               |	НачисленныйОбъемЭЭ.Сумма КАК Сумма,
	               |	НачисленныйОбъемЭЭ.СуммаСредневзвешеннаяНДС КАК СуммаСредневзвешеннаяНДС,
	               |	НачисленныйОбъемЭЭ.СуммаЗаСбытовуюНадбавкуНДС КАК СуммаЗаСбытовуюНадбавкуНДС,
	               |	НачисленныйОбъемЭЭ.СуммаЗаУслугиПоПередачиНДС КАК СуммаЗаУслугиПоПередачиНДС,
	               |	НачисленныйОбъемЭЭ.СуммаЗаИныеУслугиНДС КАК СуммаЗаИныеУслугиНДС,
	               |	НачисленныйОбъемЭЭ.СуммаНДС КАК СуммаНДС
	               |ИЗ
	               |	НачисленныйОбъемЭЭ КАК НачисленныйОбъемЭЭ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйПовышающийКоэффициент КАК МаксимальныйПовышающийКоэффициент
	               |		ПО НачисленныйОбъемЭЭ.Организация = МаксимальныйПовышающийКоэффициент.Организация
	               |			И НачисленныйОбъемЭЭ.Район = МаксимальныйПовышающийКоэффициент.Район
	               |			И НачисленныйОбъемЭЭ.МКД = МаксимальныйПовышающийКоэффициент.МКД
	               |			И НачисленныйОбъемЭЭ.ОбъектРасчета = МаксимальныйПовышающийКоэффициент.ОбъектРасчета
	               |			И НачисленныйОбъемЭЭ.ТочкаУчета = МаксимальныйПовышающийКоэффициент.ТочкаУчета
	               |ГДЕ
	               |	((НачисленныйОбъемЭЭ.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ЗамещениеИнформации)
	               |				ИЛИ НачисленныйОбъемЭЭ.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему))
	               |				И (НачисленныйОбъемЭЭ.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПерваяЦК)
	               |					ИЛИ НачисленныйОбъемЭЭ.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ВтораяЦК)
	               |					ИЛИ НачисленныйОбъемЭЭ.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.Население))
	               |			ИЛИ НачисленныйОбъемЭЭ.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ОтАктивнойЭнергии))
	               |			И НачисленныйОбъемЭЭ.ОбъемУслуги <> 0
	               |			И МаксимальныйПовышающийКоэффициент.ПовышающийКоэффициент = 0";
	
	Запрос.УстановитьПараметр("НачисленныйОбъемЭЭ", НачисленныйОбъемЭЭ);
	Возврат Запрос.Выполнить();

КонецФункции

#КонецОбласти
